/* No comment provided by engineer. */
"%@ to %@" = "%1$@ إلى %2$@";

/* No comment provided by engineer. */
"%d of %d" = "%1$d من %2$d";

/* No comment provided by engineer. */
"%li to %li" = "%1$li إلى %2$li";

/* No comment provided by engineer. */
"'item' parameter required" = "معلمة 'العنصر' مطلوبة";

/* No comment provided by engineer. */
"'portal' parameter required" = "مطلوب وجود معلمة 'البوابة الإلكترونية'";

/* No comment provided by engineer. */
"'tags' parameter required" = "مطلوب وجود معلمة 'العلامات'";

/* No comment provided by engineer. */
"'title' parameter required" = "مطلوب وجود معلمة 'العنوان'";

/* No comment provided by engineer. */
"+/-" = "+/-";

/* No comment provided by engineer. */
"<No value>" = "<بدون قيمة>";

/* No comment provided by engineer. */
"Access to the device location is denied." = "الوصول إلى موقع الجهاز مرفوض.";

/* No comment provided by engineer. */
"Actual Size" = "الحجم الفعلي";

/* No comment provided by engineer. */
"Add" = "إضافة";

/* No comment provided by engineer. */
"Add Attachment" = "إضافة مرفق";

/* No comment provided by engineer. */
"Add..." = "إضافة...";

/* No comment provided by engineer. */
"An itemID is required for this operation. Add this item to the Portal to get an ItemID." = "يُتطلب itemID لهذه العملية. أضف هذا العنصر إلى البوابة الإلكترونية للحصول على ItemID.";

/* No comment provided by engineer. */
"An uncaught NSException was detected, however the original information and callstack is not available. Break on objective-c exceptions to see the line of code causing the original NSException. For more information on how to do this please see the documentation." = "تم اكتشاف NSException غير المسبوق، ومع ذلك لا تتوفر المعلومات الأصلية ومكدس الاستدعاءات. يمكنك عمل فاصل على استثناءات الهدف-c لرؤية خط الكود الذي يؤدي إلى NSException الأصلي. للحصول على مزيد من المعلومات حول كيفية القيام بهذا، الرجاء مراجعة الوثائق.";

/* No comment provided by engineer. */
"Apply Geometry" = "تطبيق الشكل الهندسي";

/* No comment provided by engineer. */
"At least 1 facility is required to solve a route." = "يُتطلب على الأقل مرفق واحد لحل المسار.";

/* No comment provided by engineer. */
"At least 1 incident is required to solve a route." = "يُتطلب على الأقل حدث عرضي واحد لحل المسار.";

/* No comment provided by engineer. */
"At least 2 stops are required to solve a route." = "يتطلب على الأقل علامتين توقف لحل المسار.";

/* No comment provided by engineer. */
"Attachment" = "مرفق";

/* No comment provided by engineer. */
"Attachments" = "المرفقات";

/* No comment provided by engineer. */
"Attempt to use functionality that is not supported for the current license level" = "محاولة استخدام الوظائف التي لا يتم دعمها لمستوى الرخصة الحالي";

/* No comment provided by engineer. */
"Authorization required" = "يلزم التخويل";

/* No comment provided by engineer. */
"Bad Request" = "طلب غير صحيح";

/* No comment provided by engineer. */
"Bad URL." = "عنوان URL غير صحيح";

/* No comment provided by engineer. */
"bytes" = "بايت";

/* No comment provided by engineer. */
"Cancel" = "إلغاء الأمر";

/* No comment provided by engineer. */
"Cannot save to a different item type." = "يتعذر الحفظ على نوع عنصر أخر.";

/* No comment provided by engineer. */
"Cannot verify the identity of '%@'" = "لا يمكن التحقق من هوية '%@'";

/* No comment provided by engineer. */
"Certificate Required" = "شهادة مطلوبة";

/* No comment provided by engineer. */
"Challenge for URL: %@ with failureCount: %lu" = "تحدي عنوان URL: %1$@ مع failureCount: %2$lu";

/* No comment provided by engineer. */
"Changing Feature Type" = "يتم الآن تغيير نوع الميزة";

/* No comment provided by engineer. */
"Choose From Library" = "اختيار من المكتبة";

/* No comment provided by engineer. */
"Clear" = "مسح";

/* No comment provided by engineer. */
"Clear Geometry" = "مسح الشكل الهندسي";

/* No comment provided by engineer. */
"Continue" = "متابعة";

/* No comment provided by engineer. */
"Created %d hours ago" = "تم الإنشاء منذ %d ساعة (ساعات)";

/* No comment provided by engineer. */
"Created %d minutes ago" = "تم الإنشاء منذ %d دقيقة (دقائق)";

/* No comment provided by engineer. */
"Created a minute ago" = "تم الإنشاء منذ دقيقة";

/* No comment provided by engineer. */
"Created an hour ago" = "تم الإنشاء منذ ساعة";

/* No comment provided by engineer. */
"Created by %@" = "تم الإنشاء بواسطة %@";

/* No comment provided by engineer. */
"Created by %@ %d hours ago" = "تم الإنشاء بواسطة %1$@ منذ %2$d ساعة";

/* No comment provided by engineer. */
"Created by %@ %d minutes ago" = "تم الإنشاء %1$@ منذ %2$d دقيقة";

/* No comment provided by engineer. */
"Created by %@ a minute ago" = "تم الإنشاء بواسطة %@ منذ دقيقة";

/* No comment provided by engineer. */
"Created by %@ an hour ago" = "تم الإنشاء بواسطة %@ منذ ساعة";

/* No comment provided by engineer. */
"Created by %@ on %@ at %@ - day" = "تم الإنشاء بواسطة %1$@ على %2$@ عند %3$@ - يوم";

/* No comment provided by engineer. */
"Created by %@ on %@ at %@ - full" = "تم الإنشاء %1$@ يوم %2$@ في %3$@ - كامل";

/* No comment provided by engineer. */
"Created by %@ seconds ago" = "تم الإنشاء بواسطة %@ منذ ثوان";

/* No comment provided by engineer. */
"Created on %@ at %@ - day" = "تم الإنشاء يوم %1$@ في %2$@ - يوم";

/* No comment provided by engineer. */
"Created on %@ at %@ - full" = "تم الإنشاء يوم %1$@ في %2$@ - كامل";

/* No comment provided by engineer. */
"Created seconds ago" = "تم الإنشاء منذ ثوانٍ";

/* No comment provided by engineer. */
"Credential Required" = "مطلوب بيانات الاعتماد";

/* No comment provided by engineer. */
"Data for pie chart is invalid" = "بيانات المخطط الدائري غير صحيحة";

/* No comment provided by engineer. */
"Delete" = "حذف";

/* No comment provided by engineer. */
"Delete Attachment" = "حذف المرفقات";

/* No comment provided by engineer. */
"Delete Feature" = "حذف معلم";

/* No comment provided by engineer. */
"Deleting this attachment will remove it from the popup and associated data source." = "عند حذف هذا المرفق، سوف يتم إزالته من النافذة المنبثقة ومصدر البيانات المرتبط.";

/* No comment provided by engineer. */
"Deleting this feature will remove it from the map and associated data source." = "عند حذف هذا المعلم، سوف يتم إزالته من الخريطة ومصدر البيانات المرتبط.";

/* No comment provided by engineer. */
"Directions time and distance attributes do not match." = "وقت الاتجاهات والبيانات الجدولية للمسافة غير مطابقة.";

/* No comment provided by engineer. */
"Edit" = "تحرير";

/* No comment provided by engineer. */
"Edited %d hours ago" = "تم التحرير منذ %d ساعة (ساعات)";

/* No comment provided by engineer. */
"Edited %d minutes ago" = "تم التحرير منذ %d دقيقة (دقائق)";

/* No comment provided by engineer. */
"Edited a minute ago" = "تم التحرير منذ دقيقة";

/* No comment provided by engineer. */
"Edited an hour ago" = "تم التحرير منذ ساعة";

/* No comment provided by engineer. */
"Edited by %@" = "تم التحرير بواسطة %@";

/* No comment provided by engineer. */
"Edited by %@ %d hours ago" = "تم التحرير بواسطة %1$@ منذ %2$d ساعة";

/* No comment provided by engineer. */
"Edited by %@ %d minutes ago" = "تم التحرير بواسطة %1$@ منذ %2$d دقيقة";

/* No comment provided by engineer. */
"Edited by %@ a minute ago" = "تم التحرير بواسطة %@ منذ دقيقة";

/* No comment provided by engineer. */
"Edited by %@ an hour ago" = "تم التحرير بواسطة %@ منذ دقيقة";

/* No comment provided by engineer. */
"Edited by %@ on %@ at %@ - day" = "تم التحرير بواسطة %1$@ يوم %2$@ في %3$@ - يوم";

/* No comment provided by engineer. */
"Edited by %@ on %@ at %@ - full" = "تم التحرير بواسطة %1$@ يوم %2$@ في %3$@ - كامل";

/* No comment provided by engineer. */
"Edited by %@ seconds ago" = "تم التحرير بواسطة %@ منذ ثوان";

/* No comment provided by engineer. */
"Edited on %@ at %@ - day" = "تم التحرير يوم %1$@ في %2$@ - يوم";

/* No comment provided by engineer. */
"Edited on %@ at %@ - full" = "تم التحرير يوم %1$@ في %2$@ - كامل";

/* No comment provided by engineer. */
"Edited seconds ago" = "تم التحرير منذ ثوانٍ";

/* No comment provided by engineer. */
"Empty username/password" = "اسم مستخدم/كلمة مرور فارغ";

/* No comment provided by engineer. */
"Enter a date between %@ and %@" = "أدخل تاريخ بين %1$@ و%2$@";

/* No comment provided by engineer. */
"Enter a number between %@ and %@" = "أدخل رقم بين %1$@ و %2$@";

/* No comment provided by engineer. */
"Enter a number between %i and %i" = "أدخل رقم بين %1$i و %2$i";

/* No comment provided by engineer. */
"Error" = "خطأ";

/* No comment provided by engineer. */
"Error adding identity to the keychain" = "خطأ في إضافة الهوية إلى السلسلة الرئيسية";

/* No comment provided by engineer. */
"Error adding keychain item" = "حدث خطأ أثناء إضافة عنصر سلسلة المفاتيح";

/* No comment provided by engineer. */
"Error extracting identity" = "خطأ أثناء استخراج الهوية";

/* No comment provided by engineer. */
"Error Loading Page" = "حدث خطأ أثناء تحميل الصفحة";

/* No comment provided by engineer. */
"Error removing keychain item" = "حدث خطأ أثناء إزالة عنصر سلسلة المفاتيح";

/* No comment provided by engineer. */
"Error updating keychain item" = "حدث خطأ أثناء تحديث عنصر سلسلة المفاتيح.";

/* No comment provided by engineer. */
"Exceeds maximum value (%@)" = "يتجاوز قيمة الحد الأقصى (%@)";

/* No comment provided by engineer. */
"Extra Large" = "كبير للغاية";

/* No comment provided by engineer. */
"Facility (%1$@) has invalid added cost attribute names (%2$@)." = "يحتوي المرفق (%1$@) على أسماء غير صحيحة لبيانات التكلفة الجدولية المضافة (%2$@).";

/* No comment provided by engineer. */
"Facility (%1$@) has negative added cost attribute (%2$@)." = "يحتوي المرفق (%1$@) على بيانات التكلفة الجدولية المضافة بالسالب (%2$@).";

/* No comment provided by engineer. */
"Feature isn't valid." = "المعلم غير صحيح.";

/* No comment provided by engineer. */
"Finish" = "إنهاء";

/* No comment provided by engineer. */
"Finishing editing..." = "جارِ إنهاء عملية التحرير...";

/* No comment provided by engineer. */
"GB" = "جيجا بايت";

/* No comment provided by engineer. */
"Geometry" = "الرسوم الهندسية";

/* No comment provided by engineer. */
"Hide" = "إخفاء";

/* No comment provided by engineer. */
"Incident (%1$@) has invalid added cost attribute names (%2$@)." = "يحتوي الحادث (%1$@) على أسماء غير صحيحة لبيانات التكلفة الجدولية المضافة (%2$@).";

/* No comment provided by engineer. */
"Incident (%1$@) has negative added cost attribute (%2$@)." = "يحتوي الحادث (%1$@) على بيانات التكلفة الجدولية المضافة بالسالب (%2$@).";

/* No comment provided by engineer. */
"Insert Part" = "إدراج جزء";

/* No comment provided by engineer. */
"Insert Vertex" = "إدارج نقطة قممية";

/* No comment provided by engineer. */
"Invalid argument." = "وسيطة غير صالحة.";

/* No comment provided by engineer. */
"Invalid Credentials" = "اعتمادات غير صحيحة";

/* No comment provided by engineer. */
"Invalid GPX data." = "بيانات GPX غير صحيحة.";

/* No comment provided by engineer. */
"Invalid groupID." = "groupID غير صالحة.";

/* No comment provided by engineer. */
"Joining this organization is supported by invitation only, you need to receive an invitation from the administrator" = "يتم دعم الانضمام إلى المؤسسة عن طريق الدعوة فقط، ويتعين عليك استلام دعوة من المسئول";

/* No comment provided by engineer. */
"KB" = "كيلوبايت";

/* No comment provided by engineer. */
"Keep Current Values" = "الاحتفاظ بالقيم الحالية";

/* No comment provided by engineer. */
"Large" = "كبير";

/* No comment provided by engineer. */
"Less than minimum value (%@)" = "أقل من الحد الأدنى للقيمة (%@)";

/* No comment provided by engineer. */
"Licensed for Developer Use Only" = "مرخص لاستخدام المطور فقط";

/* No comment provided by engineer. */
"Loading feature..." = "جارِ تحميل بيانات المعلم...";

/* No comment provided by engineer. */
"Map contains data that cannot be saved. To save this map, which will remove this data, pass true for forceSaveToSupportedVersion." = "تحتوي الخريطة على بيانات يتعذر حفظها. لحفظ هذه الخريطة، التي ستقوم بإزالة هذه البيانات، مرر صواب لـ forceSaveToSupportedVersion.";

/* No comment provided by engineer. */
"MB" = "ميجابايت";

/* No comment provided by engineer. */
"Medium" = "متوسط";

/* No comment provided by engineer. */
"Missing client certificate" = "شهادة عميل مفقودة";

/* string to represent hyperlink attributes */
"More Info" = "مزيد من المعلومات";

/* No comment provided by engineer. */
"Move Geometry" = "نقل الشكل الهندسي";

/* No comment provided by engineer. */
"Move Part" = "نقل جزء";

/* No comment provided by engineer. */
"Move Vertex" = "تحريك النقطة القممية";

/* No comment provided by engineer. */
"No certificate found to access the resource '%@'" = "لا توجد شهادة للوصول للمورد '%@'";

/* No comment provided by engineer. */
"No data to create a bar chart" = "لا توجد بيانات لإنشاء مخطط شريطي";

/* No comment provided by engineer. */
"No data to create a line chart" = "لا توجد بيانات لإنشاء مخطط خطي";

/* No comment provided by engineer. */
"No data to create a pie chart" = "لا توجد بيانات لإنشاء مخطط دائري";

/* No comment provided by engineer. */
"No image to display" = "لا يوجد صور للعرض";

/* No comment provided by engineer. */
"No path can be found between a given pair of stops (%@)." = "يمكن العثور على المسار بين زوج علامات التوقف المقدمة (%@).";

/* No comment provided by engineer. */
"Not a valid number" = "ليس رقم صحيح";

/* No comment provided by engineer. */
"Not a valid whole number" = "ليس رقم كلي صحيح";

/* No comment provided by engineer. */
"Object cannot be created without a portal.  Use fromJSON:withPortal:error: method instead." = "يتعذر إنشاء الكائن بدون بوابة إلكترونية. استخدم بدلاً من ذلك طريقة fromJSON:withPortal:error:.";

/* No comment provided by engineer. */
"OK" = "موافق";

/* No comment provided by engineer. */
"One or more accumulate attribute names (%@) are invalid." = "أحد أسماء البيانات الجدولية المتراكمة أو أكثر من (%@) تكون غير صحيحة.";

/* No comment provided by engineer. */
"One or more attribute names (%@) associated with the custom parameter attribute values are invalid." = "أحد أسماء البيانات الجدولية أو أكثر من (%@) المرتبطة بقيم البيانات الجدولية للمعلمة المخصصة تكون غير صحيحة.";

/* No comment provided by engineer. */
"One or more facilities (%@) have a null geometry." = "أحد المرافق أو أكثر من (%@) يحتوي على شكل هندسي فارغ.";

/* No comment provided by engineer. */
"One or more facilities (%@) have an invalid curb approach." = "أحد المرافق أو أكثر من (%@) يحتوي على نهج حد غير صحيح.";

/* No comment provided by engineer. */
"One or more facilities (%@) have invalid impedance cutoff." = "أحد المرافق أو أكثر من (%@) يحتوي على حد مقاومة غير صحيح.";

/* No comment provided by engineer. */
"One or more incidents (%@) have a null geometry." = "حادثة واحدة أو أكثر من (%@) تحتوي على شكل هندسي فارغ.";

/* No comment provided by engineer. */
"One or more incidents (%@) have an invalid curb approach." = "حادثة واحدة أو أكثر من (%@) تحتوي على نهج حد غير صحيح.";

/* No comment provided by engineer. */
"One or more incidents (%@) have invalid impedance cutoff." = "حادثة واحدة أو أكثر من (%@) تحتوي على حد مقاومة غير صحيح.";

/* No comment provided by engineer. */
"One or more incidents (%@) have less than 1 target facility count." = "حادثة واحدة أو أكثر من (%@) تحتوي على عدد 1 من المرفق الهدف على الأقل.";

/* No comment provided by engineer. */
"One or more parameter names (%@) associated with the custom parameter attribute values are invalid." = "أحد أسماء المعلمات أو أكثر من (%@) المرتبطة بقيم البيانات الجدولية للمعلمة المخصصة تكون غير صحيحة.";

/* No comment provided by engineer. */
"One or more parameter value types associated with the custom parameter attribute values (%@) are invalid." = "نوع واحد أو أكثر من قيمة المعلمة المرتبطة بقيم البيانات الجدولية لمعلمة مخصصة من (%@) تكون غير صحيحة.";

/* No comment provided by engineer. */
"One or more point barriers (%@) are unlocated." = "أحد حواجز النقاط أو أكثر من (%@) غير محدد الموقع.";

/* No comment provided by engineer. */
"One or more point barriers (%@) have a null geometry." = "أحد حواجز النقاط أو أكثر من (%@) يحتوي على شكل هندسي فارغ.";

/* No comment provided by engineer. */
"One or more point barriers (%@) have an invalid added cost attribute name." = "أحد حواجز النقاط أو أكثر من (%@) يحتوي على اسم غير صحيح لبيانات التكلفة الجدولية المضافة.";

/* No comment provided by engineer. */
"One or more point barriers (%@) have an invalid curb approach." = "أحد حواجز النقاط أو أكثر من (%@) تحتوي على نهج حد غير صحيح.";

/* No comment provided by engineer. */
"One or more polygon barriers (%@) does not cover any network elements." = "لا يشمل حاجز مضلع واحد أو أكثر من (%@) أي عناصر من عناصر الشبكة.";

/* No comment provided by engineer. */
"One or more polygon barriers (%@) have a null geometry." = "أحد حواجز المضلع أو أكثر من (%@) يحتوي على شكل هندسي فارغ.";

/* No comment provided by engineer. */
"One or more polygon barriers (%@) have an invalid scaled cost attribute name." = "أحد حواجز المضلع أو أكثر من (%@) يحتوي على اسم غير صحيح لبيانات التكلفة الجدولية المحددة المقياس.";

/* No comment provided by engineer. */
"One or more polyline barriers (%@) does not cover any network elements." = "لا يشمل حاجز واحد لمتعدد الخطوط أو أكثر من (%@) أي عناصر من عناصر الشبكة.";

/* No comment provided by engineer. */
"One or more polyline barriers (%@) have a null geometry." = "أحد حواجز متعدد الخطوط أو أكثر من (%@) يحتوي على شكل هندسي فارغ.";

/* No comment provided by engineer. */
"One or more polyline barriers (%@) have an invalid scaled cost attribute name." = "أحد حواجز متعدد الخطوط أو أكثر من (%@) يحتوي على اسم غير صحيح لبيانات التكلفة الجدولية المحددة المقياس.";

/* No comment provided by engineer. */
"One or more restriction attribute names (%@) are invalid." = "أحد أسماء البيانات الجدولية للقيد أو أكثر من (%@) تكون غير صحيحة.";

/* No comment provided by engineer. */
"One or more restriction usage values (%1$@) associated with the custom parameter attribute values (%2$@) are invalid." = "إحدى قيم استخدام القيد أو أكثر من (%1$@) المرتبطة بقيم البيانات الجدولية للمعلمة المخصصة (%2$@) تكون غير صحيحة.";

/* No comment provided by engineer. */
"One or more restriction usage values (%1$@) associated with the custom parameter attribute values ((%2$@) are neutral (i.e., have no effect)." = "إحدى قيم استخدام القيد أو أكثر من (%1$@) المرتبطة بقيم البيانات الجدولية للمعلمة المخصصة (%2$@) تكون محايدة (بمعنى، ليس لديها تأثير).";

/* No comment provided by engineer. */
"One or more stops (%@) are located on a non-traversable element." = "إحدى علامات التوقف أو أكثر من (%@) توجد على عنصر غير قابل للنقل.";

/* No comment provided by engineer. */
"One or more stops (%@) are located on a soft-restricted element." = "إحدى علامات التوقف أو أكثر من (%@) توجد على عنصر ذات قيد سلس.";

/* No comment provided by engineer. */
"One or more stops (%@) are unlocated." = "إحدى علامة التوقف أو أكثر من (%@) غير محدد الموقع.";

/* No comment provided by engineer. */
"One or more stops (%@) cannot be reached from other stops." = "يتعذر الوصول إلى إحدى علامات التوقف أو أكثر من (%@) من علامات التوقف الأخرى.";

/* No comment provided by engineer. */
"One or more stops (%@) have a null geometry." = "إحدى علامات التوقف أو أكثر من (%@) تحتوي على شكل هندسي فارغ.";

/* No comment provided by engineer. */
"One or more stops (%@) have a time window end that occurs before its time window start." = "إحدى علامات التوقف أو أكثر (%@) لها نافذة زمنية تحدث قبل بدء تشغيل النافذة الزمنية.";

/* No comment provided by engineer. */
"One or more stops (%@) have a time window that starts before January 1, 1970." = "إحدى علامات التوقف أو أكثر من(%@) لها نافذة زمنية تبدأ قبل 1 يناير 1970.";

/* No comment provided by engineer. */
"One or more stops (%@) have an invalid curb approach." = "إحدى علامات التوقف أو أكثر من (%@) تحتوي على نهج حد غير صحيح.";

/* No comment provided by engineer. */
"Open in Safari" = "فتح في Safari";

/* No comment provided by engineer. */
"Password" = "كلمة المرور";

/* No comment provided by engineer. */
"Please enter a name for the new attachment" = "الرجاء إدخال اسم المرفقات الجديدة";

/* No comment provided by engineer. */
"Polygon barrier (%1$@) has negative or zero scaled cost attributes (%2$@)." = "يحتوي حاجز المضلع (%1$@) على بيانات التكلفة الجدولية بالسالب أو ذات قياس صفر (%2$@).";

/* No comment provided by engineer. */
"Polyline barrier (%1$@) has negative or zero scaled cost attributes (%2$@)." = "يحتوي حاجز متعدد الخطوط (%1$@) على بيانات التكلفة الجدولية بالسالب أو ذات قياس صفر (%2$@).";

/* No comment provided by engineer. */
"Polylines cannot be returned." = "يتعذر إرجاع متعدد الخطوط.";

/* No comment provided by engineer. */
"Public Account user cannot access this application." = "يتعذر على مستخدم الحساب العام الوصول إلى هذا التطبيق.";

/* No comment provided by engineer. */
"Remove Part" = "إزالة جزء";

/* No comment provided by engineer. */
"Remove Vertex" = "إزالة النقاط القممية";

/* No comment provided by engineer. */
"Reordering stops (Traveling Salesman Problem) is not supported when the collection of stops contains waypoints or rest breaks." = "إعادة ترتيب علامات التوقف (مشكلة رجل مبيعات السفر) غير مدعومة عندما تحتوي مجموعة من علامات التوقف على نقاط توقف أو فواصل متبقية.";

/* No comment provided by engineer. */
"Reset to Default Values" = "إعادة التعيين إلى القيم الافتراضية";

/* No comment provided by engineer. */
"Retry" = "إعادة المحاولة";

/* No comment provided by engineer. */
"Route starts or ends on a waypoint." = "يبدأن أو ينتهي المسار عند نقطة توقف.";

/* No comment provided by engineer. */
"Save Image" = "حفظ الصورة";

/* No comment provided by engineer. */
"Save Movie" = "حفظ فيلم";

/* No comment provided by engineer. */
"Sign In" = "تسجيل الدخول";

/* No comment provided by engineer. */
"Skip" = "تخطي";

/* No comment provided by engineer. */
"Small" = "صغير";

/* No comment provided by engineer. */
"Specified start time occurs before January 1, 1970." = "زمن التشغيل المحدد يحدث قبل 1 يناير 1970.";

/* No comment provided by engineer. */
"Stop (%1$@) has invalid added cost attribute names (%2$@)." = "تحتوي علامة التوقف (%1$@) على أسماء غير صحيحة لبيانات التكلفة الجدولية المضافة (%2$@).";

/* No comment provided by engineer. */
"Take Photo or Video" = "التقاط صورة أو فيديو";

/* No comment provided by engineer. */
"The default impedance cutoff is invalid." = "حد المعاوقة الافتراضي يكون غير صحيح.";

/* No comment provided by engineer. */
"The default target facility count is invalid." = "عدد مرفقات الهدف الافتراضية غير صحيح.";

/* No comment provided by engineer. */
"The directions distance attribute name (%@) is invalid." = "اسم البيانات الجدولية لمسافة الاتجاهات (%@) يكون غير صحيح.";

/* No comment provided by engineer. */
"The directions language is invalid." = "لغة الاتجاهات غير صحيحة.";

/* No comment provided by engineer. */
"The directions road class attribute is invalid." = "بيانات تصنيف طرق الاتجاهات غير صحيح.";

/* No comment provided by engineer. */
"The directions style is invalid." = "نم الاتجاهات غير صحيح.";

/* No comment provided by engineer. */
"The directions time attribute name (%@) is invalid." = "اسم البيانات الجدولية لوقت الاتجاهات (%@) يكون غير صحيح.";

/* No comment provided by engineer. */
"The impedance attribute name (%@) is invalid." = "اسم البيانات الجدولية للمعاوقة (%@) يكون غير صحيح.";

/* No comment provided by engineer. */
"The input spatial reference is undefined." = "الإسناد المكاني للمدخلات غير محدد.";

/* No comment provided by engineer. */
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "لا تحتوي الشبكة على بيانات جدولية هيكلية لإجراء عملية التخطيط للتوجيه الهيكلي.";

/* No comment provided by engineer. */
"The object must first be saved to a portal using the 'saveAs:' method." = "يجب حفظ الكائن أولاً على البوابة الإلكترونية عند استخدام طريقة 'saveAs:'.";

/* No comment provided by engineer. */
"The output spatial reference is undefined." = "الإسناد المكاني للمخرجات غير محدد.";

/* No comment provided by engineer. */
"The polygon buffer distance is invalid." = "مسافة نطاق المضلع يكون غير صحيح.";

/* No comment provided by engineer. */
"The resource you are looking for might have been removed, had its name changed, or is temporarily unavailable" = "يٌحتمل أنه قد تم حذف المورد الذي تبحث عنه، أو تم تغيير اسمه، أو غير متوفر مؤقتًا";

/* No comment provided by engineer. */
"The resulting route has traversed one or more soft-restricted elements (%@)." = "لقد تم نقل المسار الناتج عبر عنصر واحد أو أكثر من العناصر ذات القيد السلس (%@).";

/* No comment provided by engineer. */
"The route is too large to solve using the walking travel mode." = "المسار يكون كبير للغاية للحل باستخدام وضع السفر سيرًا على الأقدام.";

/* No comment provided by engineer. */
"The search where clause is not supported." = "عبارة البحث أين تكون غير مدعومة.";

/* No comment provided by engineer. */
"The server’s certificate is invalid. You might be connecting to a server that is pretending to be '%@', which could put your confidential information at risk. Would you like to connect anyway?" = "شهادة خادم غير صحيحة. قد تتصل بالخادم الذي يتظاهر بأنه '%@' والذي يستطيع تعريض معلومات سرية للخطر. هل تود الاتصال؟";

/* No comment provided by engineer. */
"The service cannot properly calculate time shift." = "يتعذر على الخدمة احتساب تغيير الوقت بصورة صحيحة.";

/* No comment provided by engineer. */
"The specified clientID is invalid" = "clientID المحدد غير صحيح";

/* No comment provided by engineer. */
"The stop type property was ignored for stops (%@) because the server does not support selected type of stop." = "تم تجاهل خاصية نوع علامة التوقف لعلامات التوقف (%@) نظرًا لأن الخادم لا يدعم النوع المحدد لعلامة التوقف.";

/* No comment provided by engineer. */
"The travel mode has been set to default." = "لقد تم تعيين وضع السفر إلى الوضع الافتراضي.";

/* No comment provided by engineer. */
"The waypoints (%@) contain added cost attribute." = "تحتوي نقاط التوقف (%@) على بيانات التكلفة الجدولية المضافة.";

/* No comment provided by engineer. */
"The waypoints (%@) contain time windows." = "تحتوي نقاط التوقف (%@) على النافذة الزمنية.";

/* No comment provided by engineer. */
"There was an error loading the feature. Please check your network connectivity." = "كان هناك خطأ أثناء تحميل المعلم. الرجاء التحقق من اتصال الشبكة.";

/* No comment provided by engineer. */
"Time windows start date was changed." = "تم تغيير تاريخ بدء النوافذ الزمنية.";

/* No comment provided by engineer. */
"Time windows were ignored because the impedance attribute is not time based." = "تم تجاهل النوافذ الزمنية نظرًا لأن بيانات المعاوقة الجدولية لا تستند إلى وقت.";

/* No comment provided by engineer. */
"To save as a new item, you must be logged in to the portal." = "لحفظ باسم عنصر جديد، يتعين عليك تسجيل الدخول إلى البوابة الإلكترونية.";

/* No comment provided by engineer. */
"Today" = "اليوم";

/* No comment provided by engineer. */
"Token is invalid or has expired" = "الرمز المميز غير صحيح أو انتهت صلاحيته";

/* No comment provided by engineer. */
"Token URL is nil. You must set a valid token URL on the credential." = "عنوان URL للرقم المميز هو لا شيء";

/* No comment provided by engineer. */
"Unable to login with provided credentials." = "يتعذر تسجيل الدخول مع بيانات الاعتماد المتوفرة.";

/* No comment provided by engineer. */
"Unable to retrieve user profile from the provider" = "يتعذر استرداد ملف تعريف المستخدم من الموفر";

/* No comment provided by engineer. */
"Unauthorized access" = "الوصول الغير مخول";

/* No comment provided by engineer. */
"Unknown authentication error" = "خطأ مصادقة غير معروف";

/* No comment provided by engineer. */
"Unknown condition." = "الحالة غير معروفة.";

/* No comment provided by engineer. */
"Unknown error occurred" = "حدث خطأ غير معروف";

/* No comment provided by engineer. */
"Unsupported GPX data." = "بيانات GPX غير المدعومة.";

/* No comment provided by engineer. */
"User canceled error" = "قام المستخدم بإلغاء الخطأ";

/* No comment provided by engineer. */
"User licenses assigned by your organization are invalid. Please contact your administrator to adjust the license assignments and try again." = "تراخيص المستخدم التي قامت المؤسسة بتعيينها غير صحيحة. يرجى الاتصال بالمسئول لتعديل مهام الترخيص وإعادة المحاولة.";

/* No comment provided by engineer. */
"Username" = "اسم المستخدم";

/* No comment provided by engineer. */
"Using browser to authenticate..." = "استخدام المستعرض لمصادقة...";

/* No comment provided by engineer. */
"Value exceeds maximum field length of %lu" = "تتجاوز القيمة الحد الأقصى من طول حقل %lu";

/* No comment provided by engineer. */
"You are changing the feature type. Would you like to keep your current values (where possible) or reset to defaults?" = "أنت تقوم بتغيير نوع المعالم. هل تود الاحتفاظ بالقيم الحالية (إذا كان ممكنًا) أو إعادة تعيين الوضع الافتراضي؟";

/* No comment provided by engineer. */
"You cannot sign in because you do not have an organization account associated with your social network credentials" = "لا يمكنك تسجيل الدخول لأنه لا يتوفر لديك حساب مؤسسي مرتبط ببيانات اعتماد شبكة التواصل الاجتماعي الخاصة بك";

/* No comment provided by engineer. */
"You do not have permissions to access this resource" = "لا توجد لديك التصريحات اللازمة للدخول إلى هذا المورد";

/* No comment provided by engineer. */
"You do not have sufficient user level to access this application." = "لا يتوفر لديك مستوى المستخدم الكافي للوصول إلى هذا التطبيق.";

/* No comment provided by engineer. */
"You must be logged in to the Portal to perform this operation." = "يجب عليك تسجيل الدخول إلى البوابة الإلكترونية لإجراء هذه العملية.";

/* No comment provided by engineer. */
"You must be specify a rating between 1 and 5." = "يجب عليك تحديد التصنيف بين 1 و5.";

/* No comment provided by engineer. */
"You must specify a location usage description key (NSLocationWhenInUseUsageDescription or NSLocationAlwaysUsageDescription) in your plist." = "يجب عليك تحديد مفتاح وصف استخدام الموقع (NSLocationWhenInUseUsageDescription أو NSLocationAlwaysUsageDescription) في البليست.";

/* No comment provided by engineer. */
"You need to select a certificate to access the resource '%@'" = "تحتاج إلى تحديد الشهادة للوصول لعنصر '%@'";

/* No comment provided by engineer. */
"You need to sign in to access the resource '%@'" = "تحتاج إلى تسجيل الدخول للوصول لعنصر '%@'";

/* No comment provided by engineer. */
"• " = "• ";

﻿/* Localizable+Additions.strings */

/* Unit Abbreviated strings */
"cm" = "سم";
"dd" = "dd";
"dm" = "ديسيمتر";
"ft" = "قدم";
"in" = "بوصة";
"km" = "كيلومتر";
"m" = "متر";
"mi" = "ميل";
"mm" = "ملم";
"nm" = "ميل بحري";
"pt" = "pt";
"Unknown" = "غير معروف";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "سنتيميتر";
"Decimal Degrees" = "الدرجات العشرية";
"Decimeters" = "ديسيميتر";
"Feet" = "قدم";
"Inches" = "بوصة";
"Kilometers" = "كيلومترات";
"Meters" = "أمتار";
"Miles" = "أميال";
"Millimeters" = "ميلليميتر";
"Nautical Miles" = "الأميال البحرية";
"Points" = "نقاط";
"Yards" = "ياردات";

/* Area Units Abbreviated Strings */
"sq. in" = "sq. in";
"sq. ft" = "قدم مربع";
"sq. yd" = "يارد مربعة";
"ac" = "ac";
"sq. mi" = "ميل مربع";
"sq. mm" = "ملليمتر مربع";
"sq. cm" = "سنتيمتر مربع";
"sq. dm" = "ديسيمتر مربع";
"sq. m" = "متر مربع";
"ares" = "آر";
"ha" = "هكتار";
"sq. km" = "كيلومتر مربع";

/* Area Units Display Strings */
"Square Inches" = "بوصات مربعة";
"Square Feet" = "قدم مربع";
"Square Yards" = "ياردات مربعة";
"Acres" = "فدان";
"Square Miles" = "ميل مربع";
"Square Millimeters" = "ميلليمترات مربعة";
"Square Centimeters" = "سنتيمترات مربعة";
"Square Decimeters" = "ديسيمترات مربعة";
"Square Meters" = "أمتار مربعة";
"Ares" = "آر";
"Hectares" = "هكتار";
"Square Kilometers" = "كيلومترات مربعة";

